---
kind: method
id: M:Autodesk.Revit.DB.HermiteSplineTangents.Dispose
source: html/0d0fb39b-5a0e-d9b7-bd26-bcb8624bc909.htm
---
# Autodesk.Revit.DB.HermiteSplineTangents.Dispose Method

Releases all resources used by the HermiteSplineTangents

## Syntax (C#)
```csharp
public void Dispose()
```